Revit 2027 API
PointOnEdgeFaceIntersection Methods
The PointOnEdgeFaceIntersection type exposes the following members.
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEdgeReference | Get a copy of the edge or curve reference.
GetFaceReference | Get a copy of the face reference.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEdgeReference | Change the edge or curve reference.
SetFaceReference | Change the face reference.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace